// Software Inventory by DeviceName


DeviceInfo
| where MachineGroup == "Clients" | distinct DeviceName, MachineGroup
| join kind=inner DeviceTvmSoftwareInventory on DeviceName
| extend Software = strcat(SoftwareName, " - ", SoftwareVendor)
//| summarize Hostnames = make_list(pack("Hostname", DeviceName, "SoftwareVendor", SoftwareVendor)) by SoftwareName
| summarize HostnameSet = make_set(DeviceName) by Software
